app/views/posts/_form.html.erb

  <% if @post.author.nil? %>
    <%= f.select :author_id, options_from_collection_for_select(Author.all, :id, :name) %><br>
---
SELECT "authors".* FROM "authors"